import Api from "@/api/Api";

const endpoint = "/Dashboard";

const DashboardApi = {
  // =====================================================
  // DASHBOARD
  // =====================================================

  // تمام اطلاعات داشبورد
  getDashboard: () =>
    Api.get(`${endpoint}/dashboard`),

  // =====================================================
  // STATS
  // =====================================================

  // آمار کارت‌های داشبورد
  getStats: () =>
    Api.get(`${endpoint}/stats`),

  // =====================================================
  // REVENUE
  // =====================================================

  // درآمد
  getRevenue: () =>
    Api.get(`${endpoint}/revenue`),

  // =====================================================
  // APPOINTMENTS
  // =====================================================

  // وضعیت نوبت‌ها
  getAppointments: () =>
    Api.get(`${endpoint}/appointments`),

  // =====================================================
  // RECENT PATIENTS
  // =====================================================

  // بیماران اخیر
  getRecentPatients: () =>
    Api.get(`${endpoint}/recent-patients`),

  // =====================================================
  // RECENT APPOINTMENTS
  // =====================================================

  // نوبت‌های اخیر
  getRecentAppointments: () =>
    Api.get(`${endpoint}/recent-appointments`),

  // =====================================================
  // ACTIVITIES
  // =====================================================

  // فعالیت‌های اخیر
  getActivities: () =>
    Api.get(`${endpoint}/activities`),
};

export default DashboardApi;